In [4]:
import sys

In [5]:
sys.path.append('.')

In [7]:
import DAO

In [8]:
import numpy as np

In [9]:
import pandas as pd

In [10]:
df1 = pd.DataFrame(np.arange(30).reshape(5, 6), columns=list('ABCDEF'), index=list('abcde'))

In [11]:
df1

    A   B   C   D   E   F
a   0   1   2   3   4   5
b   6   7   8   9  10  11
c  12  13  14  15  16  17
d  18  19  20  21  22  23
e  24  25  26  27  28  29

In [13]:
import datedays

In [14]:
datedays.getnow()

'2023-03-14 20:24:33'

In [15]:
datedays.gettodaydays()

['2023-03-14',
 '2023-03-15',
 '2023-03-16',
 '2023-03-17',
 '2023-03-18',
 '2023-03-19',
 '2023-03-20',
 '2023-03-21',
 '2023-03-22',
 '2023-03-23',
 '2023-03-24',
 '2023-03-25',
 '2023-03-26',
 '2023-03-27',
 '2023-03-28',
 '2023-03-29',
 '2023-03-30',
 '2023-03-31']

In [16]:
datedays.getnextdays()

['2023-04-01',
 '2023-04-02',
 '2023-04-03',
 '2023-04-04',
 '2023-04-05',
 '2023-04-06',
 '2023-04-07',
 '2023-04-08',
 '2023-04-09',
 '2023-04-10',
 '2023-04-11',
 '2023-04-12',
 '2023-04-13',
 '2023-04-14',
 '2023-04-15',
 '2023-04-16',
 '2023-04-17',
 '2023-04-18',
 '2023-04-19',
 '2023-04-20',
 '2023-04-21',
 '2023-04-22',
 '2023-04-23',
 '2023-04-24',
 '2023-04-25',
 '2023-04-26',
 '2023-04-27',
 '2023-04-28',
 '2023-04-29',
 '2023-04-30']

In [69]:
datedays.getdays()[1:2]

['2023-03-15']

In [18]:
datedays.getdays()[1:16]

['2023-03-15',
 '2023-03-16',
 '2023-03-17',
 '2023-03-18',
 '2023-03-19',
 '2023-03-20',
 '2023-03-21',
 '2023-03-22',
 '2023-03-23',
 '2023-03-24',
 '2023-03-25',
 '2023-03-26',
 '2023-03-27',
 '2023-03-28',
 '2023-03-29']

In [21]:
datedays.gettodaydays(today='2032-02-01')

['2032-02-01',
 '2032-02-02',
 '2032-02-03',
 '2032-02-04',
 '2032-02-05',
 '2032-02-06',
 '2032-02-07',
 '2032-02-08',
 '2032-02-09',
 '2032-02-10',
 '2032-02-11',
 '2032-02-12',
 '2032-02-13',
 '2032-02-14',
 '2032-02-15',
 '2032-02-16',
 '2032-02-17',
 '2032-02-18',
 '2032-02-19',
 '2032-02-20',
 '2032-02-21',
 '2032-02-22',
 '2032-02-23',
 '2032-02-24',
 '2032-02-25',
 '2032-02-26',
 '2032-02-27',
 '2032-02-28',
 '2032-02-29']

In [22]:
datedays.getstartend(start_date='2022-08-01', end_date='2022-08-07', list_=True)

['2022-08-01',
 '2022-08-02',
 '2022-08-03',
 '2022-08-04',
 '2022-08-05',
 '2022-08-06',
 '2022-08-07']

In [75]:
df2 = pd.DataFrame({'fund_code': ['SCK841' for _ in range(8)], 
                    'c_sec_code': ['dtgt01', 'dqsy02', 'dmnn03', 'dtgt01', 'dqsy02', 'dmnn03', 'dtgt01', 'dqsy02'], 
                    'c_pos_name': ['大唐钢铁', '大清石油', '大明牛奶', '大唐钢铁', '大清石油', '大明牛奶', '大唐钢铁', '大清石油'], 
                   'd_date': [datedays.getdays()[1:2][0], datedays.getdays()[1:2][0], datedays.getdays()[1:2][0], 
                              datedays.getdays()[2:3][0], datedays.getdays()[2:3][0], datedays.getdays()[2:3][0],
                              datedays.getdays()[3:4][0], datedays.getdays()[3:4][0]], 
                   'n_port_mv': [i * 1000000 for i in range(1, 9)]})

In [76]:
df2

  fund_code c_sec_code c_pos_name      d_date  n_port_mv
0    SCK841     dtgt01       大唐钢铁  2023-03-15    1000000
1    SCK841     dqsy02       大清石油  2023-03-15    2000000
2    SCK841     dmnn03       大明牛奶  2023-03-15    3000000
3    SCK841     dtgt01       大唐钢铁  2023-03-16    4000000
4    SCK841     dqsy02       大清石油  2023-03-16    5000000
5    SCK841     dmnn03       大明牛奶  2023-03-16    6000000
6    SCK841     dtgt01       大唐钢铁  2023-03-17    7000000
7    SCK841     dqsy02       大清石油  2023-03-17    8000000

In [85]:
df3 = pd.pivot(df2, index=['fund_code', 'c_sec_code', 'c_pos_name'], columns='d_date', values='n_port_mv')

In [86]:
df3

d_date                           2023-03-15  2023-03-16  2023-03-17
fund_code c_sec_code c_pos_name
SCK841    dmnn03     大明牛奶         3000000.0   6000000.0         NaN
          dqsy02     大清石油         2000000.0   5000000.0   8000000.0
          dtgt01     大唐钢铁         1000000.0   4000000.0   7000000.0

In [87]:
df4 = df3.reset_index()

In [88]:
df4.fillna('--')

d_date fund_code c_sec_code c_pos_name  2023-03-15  2023-03-16 2023-03-17
0         SCK841     dmnn03       大明牛奶   3000000.0   6000000.0         --
1         SCK841     dqsy02       大清石油   2000000.0   5000000.0  8000000.0
2         SCK841     dtgt01       大唐钢铁   1000000.0   4000000.0  7000000.0

In [89]:
df5 = pd.melt(df4, id_vars=['fund_code', 'c_pos_name', 'c_sec_code'], value_vars=df4.columns[2:])

In [90]:
df6 = df5.dropna(axis=0, how='any')

In [91]:
df7 = df6.reset_index(drop=True)

In [92]:
df7

  fund_code c_pos_name c_sec_code      d_date      value
0    SCK841       大明牛奶     dmnn03  2023-03-15  3000000.0
1    SCK841       大清石油     dqsy02  2023-03-15  2000000.0
2    SCK841       大唐钢铁     dtgt01  2023-03-15  1000000.0
3    SCK841       大明牛奶     dmnn03  2023-03-16  6000000.0
4    SCK841       大清石油     dqsy02  2023-03-16  5000000.0
5    SCK841       大唐钢铁     dtgt01  2023-03-16  4000000.0
6    SCK841       大清石油     dqsy02  2023-03-17  8000000.0
7    SCK841       大唐钢铁     dtgt01  2023-03-17  7000000.0

In [105]:
df7.groupby('d_date').mean()

                value
d_date
2023-03-15  2000000.0
2023-03-16  5000000.0
2023-03-17  7500000.0

In [97]:
df7

  fund_code c_pos_name c_sec_code      d_date      value
0    SCK841       大明牛奶     dmnn03  2023-03-15  3000000.0
1    SCK841       大清石油     dqsy02  2023-03-15  2000000.0
2    SCK841       大唐钢铁     dtgt01  2023-03-15  1000000.0
3    SCK841       大明牛奶     dmnn03  2023-03-16  6000000.0
4    SCK841       大清石油     dqsy02  2023-03-16  5000000.0
5    SCK841       大唐钢铁     dtgt01  2023-03-16  4000000.0
6    SCK841       大清石油     dqsy02  2023-03-17  8000000.0
7    SCK841       大唐钢铁     dtgt01  2023-03-17  7000000.0

In [101]:
pd.pivot_table(df7, index='d_date', columns='c_pos_name', values='value')

c_pos_name       大唐钢铁       大明牛奶       大清石油
d_date
2023-03-15  1000000.0  3000000.0  2000000.0
2023-03-16  4000000.0  6000000.0  5000000.0
2023-03-17  7000000.0        NaN  8000000.0

In [107]:
df7.pivot_table(values='value', index='fund_code', columns='d_date')

d_date     2023-03-15  2023-03-16  2023-03-17
fund_code
SCK841      2000000.0   5000000.0   7500000.0

In [110]:
df7.pivot_table(values='value', index='fund_code', columns='d_date', aggfunc=np.sum)

d_date     2023-03-15  2023-03-16  2023-03-17
fund_code
SCK841      6000000.0  15000000.0  15000000.0

In [113]:
pd.pivot_table(df7, values='value', index='fund_code', columns='d_date', aggfunc=np.sum, margins=True)

d_date     2023-03-15  2023-03-16  2023-03-17         All
fund_code
SCK841      6000000.0  15000000.0  15000000.0  36000000.0
All         6000000.0  15000000.0  15000000.0  36000000.0